Tekla.Structures.Drawing.IHasChildren
The IHasChildren interface is implemented by objects that have child objects.

Tekla.Structures.Drawing.IHasChildren.GetObjects
Gets the children of the current object.
Returns: The children of the current object.

Tekla.Structures.Drawing.IHasChildren.GetObjects(System.Type[])
Gets the children of the current object that are of certain types.
TypeFilter: The types of the objects to get.
Returns: The children of the current object that are of certain types.